controllers/MetaweblogController.php

SELECT * FROM "jp_blogConfig" WHERE "isEnable"=1
---
    public function actionIndex(){
        $d = $this->data;
        $model =$this->modelClass;

        $filter = ['isDelete'=>0];
        $offset = !empty($d['page']) ? $d['page']:1;
        $orderType = ['createtime'=>SORT_DESC];
        $count = $model::find()->select('id')->where(['isDelete'=>0])->count();
        $pagination = new \yii\data\Pagination([ 'defaultPageSize' => 5, 'totalCount'=>$count,]);//print_r($pagination->limit);die;
        $this->result = $model::getList($cols = array(), $filter , $offset , $limit=$pagination->limit , $andWhere='', $orWhere='', $orderType ,$andWhereArray = []);

        //查询配置
        $configs = JpBlogConfig::find()->where(['isEnable'=>1])->asArray()->all();

SELECT * FROM "jp_blogConfig" WHERE "isEnable"=1
---
    public function actionAdd(){

        //查询配置
        $configs = JpBlogConfig::find()->where(['isEnable'=>1])->asArray()->all() or Common::echoJson(400,'请自动化配置');