controllers/MetaweblogController.php

    public function actionIndex(){
        $d = $this->data;
        $model =$this->modelClass;

        $filter = ['isDelete'=>0];
        $offset = !empty($d['page']) ? $d['page']:1;
        $orderType = ['createtime'=>SORT_DESC];
        $count = $model::find()->select('id')->where(['isDelete'=>0])->count();
        $pagination = new \yii\data\Pagination([ 'defaultPageSize' => 5, 'totalCount'=>$count,]);//print_r($pagination->limit);die;
        $this->result = $model::getList($cols = array(), $filter , $offset , $limit=$pagination->limit , $andWhere='', $orWhere='', $orderType ,$andWhereArray = []);
        $blogConfig = JpBlogConfig::find()->where(['blogType'=>6])->asArray()->one();
---
SELECT * FROM "jp_blogConfig" WHERE "blogType"=6

    public function actionAdd(){

        //查询分类
        $blogConfig = JpBlogConfig::find()->where(['blogType'=>6])->asArray()->one();       //获取博客园配置
        $MetaWeblog = new MetaWeblog();
        $Categories = $MetaWeblog->get( $blogConfig['blogType'],$blogConfig['username'] , $blogConfig['password'] ,$blogConfig['blogid'], $isCache = 1 );
---
SELECT * FROM "jp_blogConfig"

    public function actionEdit(){
        $d = $this->data;
        if( empty($d['blogId']) ) Common::echoJson(403,'参数错误');

        //查询分类
        $blogConfig = JpBlogConfig::find()->where(['blogType'=>6])->asArray()->one();       //获取博客园配置
        $MetaWeblog = new MetaWeblog();
        $Categories = $MetaWeblog->get( $blogConfig['blogType'],$blogConfig['username'] , $blogConfig['password'] ,$blogConfig['blogid'], $isCache = 1 );
---
SELECT * FROM "jp_blogConfig" WHERE "blogType"=6

    public function actionInit(){
        $d = $this->data;
        if( !empty($d['blogType']) ){
            //检测是否正确
            //查询分类
            $MetaWeblog = new MetaWeblog();
            $blogName = Common::blogParamName($d['blogType']);
            $Categories = $MetaWeblog->get( $d['blogType'],$d['username'] , $d['password'] ,$d['blogid'], $isCache = 0 );
            if( !is_array($Categories) ) Common::echoJson(400,'设置参数有误，请仔细核对下');

            $DB = new DB();
            if( !JpBlogConfig::find()->where(['blogType'=>$d['blogType']])->asArray()->one() ){
                $DB->insert(JpBlogConfig::tableName(),['blogType'=>$d['blogType'],'username'=>$d['username'],'password'=>$d['password'],'blogid'=>$d['blogid'],'isEnable'=>$d['isEnable']]);
            }else{
                $DB->update(JpBlogConfig::tableName(),['username'=>$d['username'],'password'=>$d['password'],'blogid'=>$d['blogid'],'isEnable'=>$d['isEnable']],['blogType'=>$d['blogType']]);
            }
//            Common::echoJson(200,'设置成功');
        }
        $blogConfig = JpBlogConfig::find()->asArray()->all();
---
SELECT * FROM "jp_blogConfig"